In [1]:
import pandas as pd

# 1 
## Five functions of pandas library

In [2]:
df = pd.DataFrame({"Name":["Ravi","Shikha","Lalit","Ajay","Kirti","Anand"],
                   "Ages":[23,21,22,19,20,21],
                  "Subjects":["Vectors","Geometry","Trignometry","Probability","Real Algebra","Abstract Algebra"]})

In [3]:
df

     Name  Ages          Subjects
0    Ravi    23           Vectors
1  Shikha    21          Geometry
2   Lalit    22       Trignometry
3    Ajay    19       Probability
4   Kirti    20      Real Algebra
5   Anand    21  Abstract Algebra

In [4]:
#1 head()
df.head()

     Name  Ages      Subjects
0    Ravi    23       Vectors
1  Shikha    21      Geometry
2   Lalit    22   Trignometry
3    Ajay    19   Probability
4   Kirti    20  Real Algebra

In [5]:
#2 tail()
df.tail()

     Name  Ages          Subjects
1  Shikha    21          Geometry
2   Lalit    22       Trignometry
3    Ajay    19       Probability
4   Kirti    20      Real Algebra
5   Anand    21  Abstract Algebra

In [6]:
#3 sort_values
df.sort_values("Ages")

     Name  Ages          Subjects
3    Ajay    19       Probability
4   Kirti    20      Real Algebra
1  Shikha    21          Geometry
5   Anand    21  Abstract Algebra
2   Lalit    22       Trignometry
0    Ravi    23           Vectors

In [7]:
#4 info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Ages      6 non-null      int64
 2   Subjects  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [8]:
#5 describe()
df.describe()

            Ages
count   6.000000
mean   21.000000
std     1.414214
min    19.000000
25%    20.250000
50%    21.000000
75%    21.750000
max    23.000000

# 2

In [9]:
df = pd.DataFrame(['A','B','C'])

In [10]:
df

   0
0  A
1  B
2  C

In [11]:
df.index = pd.Index([1,3,5]) # This is used to change the index

In [12]:
df

   0
1  A
3  B
5  C

# 3

In [13]:
df = pd.DataFrame({"Values":[10,20,30,40,50]})

In [14]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [15]:
lis = list(df['Values'])

In [16]:
sum = 0
for i in range(len(lis)):    
    if i == 3:        
        break        
    sum+= lis[i]    
print(sum) # sum of 1st three elements

60

# 4

In [17]:
df = pd.DataFrame({"Text":["Python","Java","PHP","Javascript","Julia","Go","C"]})

In [18]:
df

         Text
0      Python
1        Java
2         PHP
3  Javascript
4       Julia
5          Go
6           C

In [19]:
def counts(dataFrame):
    elements = list(dataFrame['Text'])
    count = [len(ele) for ele in elements]
    dataFrame['Word_Count'] = count
    return pd.DataFrame(dataFrame)

In [20]:
counts(df)

         Text  Word_Count
0      Python           6
1        Java           4
2         PHP           3
3  Javascript          10
4       Julia           5
5          Go           2
6           C           1

# 5

In [21]:
df = pd.DataFrame({"Col_1":['A','B','C','D'],"Col_2":[10,20,30,40]})

In [22]:
df

  Col_1  Col_2
0     A     10
1     B     20
2     C     30
3     D     40

### size return the total elements in the dataframe

In [23]:
df.size

8

### shape return the no of rows and columns in the dataframe

In [24]:
df.shape

(4, 2)

# 6
### read_csv() method is used to read the csv file from local disk

In [25]:
cities = pd.read_csv('cities.csv')

In [26]:
cities

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI
...,...,...,...,...,...,...,...,...,...,...
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

# 7

In [27]:
df = pd.DataFrame({"Email":["rahul@gmail.com",
                            "sahil@hotmail.com",
                            "shanya@outlook.com",
                            "pragya@hotmail.com",
                            "sheetal@gmail.com"]})

In [28]:
df

                Email
0     rahul@gmail.com
1   sahil@hotmail.com
2  shanya@outlook.com
3  pragya@hotmail.com
4   sheetal@gmail.com

In [29]:
def usernames(dataFrame):
    elements = list(dataFrame['Email'])
    names = [ele.split('@')[0] for ele in elements]
    dataFrame['Username'] = names
    return pd.DataFrame(dataFrame)

In [30]:
usernames(df)

                Email Username
0     rahul@gmail.com    rahul
1   sahil@hotmail.com    sahil
2  shanya@outlook.com   shanya
3  pragya@hotmail.com   pragya
4   sheetal@gmail.com  sheetal

# 8 
### we have select those records were "A" > 5 and "B" < 10

In [31]:
df = pd.DataFrame({'A':[3,8,5,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [32]:
df[ (df['A'] > 5) & (df['B'] < 10) ]

   A  B  C
1  8  2  7
4  9  1  2

# 9
### Calculating mean, median, standard deviation

In [33]:
df = pd.DataFrame({"Values":[22,35,67,56,78,12,89]})

In [34]:
df

   Values
0      22
1      35
2      67
3      56
4      78
5      12
6      89

In [35]:
# For mean
def mean(df):
    sum = 0
    for ele in df['Values']:
        sum+=ele
    return sum/len(df['Values'])

print(f'Mean:{round(mean(df),2)}')

Mean:51.29

In [36]:
# For median which is midvalue of the Values after arranging in increasing or decreasing order
def median(df):
    sorted = df.sort_values('Values')
    n = len(sorted)
    if n % 2 != 0:
        return int(df.loc[n//2])
    else:
        return int(df.loc[((n/2) + ((n/2)+1))/2])
    
print(f'Median:{median(df)}')

Median:56

In [37]:
# For Strand Deviation we have calcuate variance
import statistics as st

def median(df):
    sorted = df.sort_values('Values')
    standard_deviation = st.stdev(sorted['Values'])
    
    return standard_deviation    

print(f'Standard Deviation:{round(median(df),3)}')

Standard Deviation:29.073

# 10

DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.11

In [55]:
df = pd.DataFrame({"Sales":[10000,18000,12000,15000,9000,13000],"Date":[11,12,13,14,15,16]})

In [56]:
df

   Sales  Date
0  10000    11
1  18000    12
2  12000    13
3  15000    14
4   9000    15
5  13000    16

In [59]:
def moving_average(df):
    df = df.sort_values('Date')   
    rolling_avg = df['Sales'].rolling(window=7, min_periods=1).mean()    
    df['MovingAverage'] = rolling_avg
    
    return df

In [60]:
moving_average(df)

   Sales  Date  MovingAverage
0  10000    11   10000.000000
1  18000    12   14000.000000
2  12000    13   13333.333333
3  15000    14   13750.000000
4   9000    15   12800.000000
5  13000    16   12833.333333

# 11

In [39]:
df = pd.DataFrame({"Date":["2023-01-01","2023-01-02", "2023-01-03", "2023-01-04","2023-01-05"]})

In [40]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [41]:
def weekdays(dataFrame):
    days = ['Sunday','Monday','Tuesday','Wednesday','Thrusday']
    dataFrame['Weekdays'] = days
    return pd.DataFrame(dataFrame)

In [42]:
weekdays(df)

         Date   Weekdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thrusday

# 12

In [43]:
import datetime as dt

In [44]:
df = pd.DataFrame({"Date":[dt.date(2023,1,2),
                           dt.date(2023,1,5),
                           dt.date(2021,1,24),
                           dt.date(2022,6,28),
                           dt.date(2023,1,4),
                           dt.date(2023,1,17),
                           dt.date(2023,11,20),
                           dt.date(2021,1,30),
                           dt.date(2023,2,13),
                           ]})

In [45]:
df

         Date
0  2023-01-02
1  2023-01-05
2  2021-01-24
3  2022-06-28
4  2023-01-04
5  2023-01-17
6  2023-11-20
7  2021-01-30
8  2023-02-13

In [46]:
def selected(dataFrame):    
    selected_dates = [date for date in list(df['Date']) if (date > dt.date(2023,1,1)) and (date < dt.date(2023,1,31)) ]
    return pd.DataFrame({'Jan 2023':selected_dates})

In [47]:
selected(df)

     Jan 2023
0  2023-01-02
1  2023-01-05
2  2023-01-04
3  2023-01-17

# 13
### To use the basic functions of pandas, We have to import 'pandas' module so we can use baisc methods of this module
#### Example

In [48]:
import pandas as pd

In [49]:
df = pd.DataFrame({"Col A":[12,34,56,78,63]})

In [50]:
df.head()

   Col A
0     12
1     34
2     56
3     78
4     63

In [51]:
df.tail()

   Col A
0     12
1     34
2     56
3     78
4     63

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col A   5 non-null      int64
dtypes: int64(1)
memory usage: 168.0 bytes